Repository: giellalt/corpus-fin
Catalog: tmx/smn/admin/sd/www.samediggi.fi/index2.php_option=com_content_task=view_id=1084_lang=finnish.html.tmx
Source language: fin
Languages: smn

source: " Hirviöräppiä " inarinsaameksi
smn: " Hirmâdâsráp " anarâškielân

source: Saameräpin isä Amoc räppää uhanalaisella inarinsaamella, jonka puhujia on nykyään arviolta 350-450.
smn: Sämiráp eeči Amoc ráppáá uhkevuálásâš anarâškieláin, mon sárnooh láá onnáá peeivi áárvu mield 350-450.

source: Kieli on elpynyt viimeisten kahdenkymmenen vuoden aikana erityisesti kielipesätoiminnan ansiosta, jonka laittoi Mikkalin isä Matti Morottaja taannoin käyntiin.
smn: Kielâ lii iäláskâm majemui kyevtlov ive äigin eromâšávt kielâpiervâltooimâ tiet. Mikkâl eeči Matti Morottaja lii lamaš piejâmin kielâpiervâl joton.

source: Amocia on kutsuttu inarinsaamen lähettilääksi, mutta itse hän painottaa, että on vain yksi tekijä muiden kielen eteen työskentelevien joukossa.
smn: Amoc lii kočodum anarâškielâ sänituálvoojin, mutâ sun jieš iätá, et sun tuše ohtâ olmooš iärrásij kielâ oovdân pargei juávhust.

source: Inarinsaameksi Amoc alkoi räpätä ensin kokeilumielessä, mutta koska se on hänen äidinkielensä, niin se oli myös luonnollista.
smn: Amoc aalgij ráppáđ anarâškielân vistig keččâlemmieláin, mutâ tot lâi sunjin meiddei luándulâs, tondiet ko tot lii suu eenikielâ.

source: Amoc kokee musiikin tekemisen ja kirjoittamisen lähtökohtaisesti terapiatyönä.
smn: Amoc tobdá muusik rähtim já čäällim terapiatoimân.

source: Inarinsaamenkielen käyttö ja kehittäminen siinä samalla on hienoa bonusta.
smn: Anarâškielâ kevttim já ovdevem tast siämmást lii fijnâ lase.

source: Amoc keikalla Taiga Festivalilla 2015 Tankavaarassa.
smn: Amoc lávástâlmin Taiga Festivaalist 2015 Tankaväärist.

source: Kun suomiräp nousi 90-luvun lopulla suosioon, Mikkalkin innostui siitä, koska se oli tavallaan helppo musiikkimuoto.
smn: Ko suomâráp aalgij leđe piivnoh 90-lovo loopâst, Mikkâl še movtáskij tast, ko tot lâi oovtâ mielâst älkkees muusikhäämi.

source: Hän kiinnostui erityisesti sanoilla leikkimisestä ja teknisestä räpistä, kaikesta siitä mitä riimeillä voi saada aikaan.
smn: Sun mielâstui eromâšávt sanijguim konstušmân já teknisâš rääpin, puoh riimij máhđulâsvuođâid.

source: Amoc on itse kuvannut musiikkiaan joskus ympäripyöreästi ” hirviöräpiksi ” ja sitä on havaittavissa joidenkin kappaleiden tarinoinnissa.
smn: Amoc jieš lii kuvvim suu muusik ” hirmâdâsräppin ” ja tot huámášuvá motomij pitái mainâsijn.

source: Raskaan räpin lisäksi Amocin tuotannosta löytyy myös tunteisiin vetoavia kappaleita.
smn: Lusis rääpi lasseen Amoc lii ráhtâm meiddei tobdoid kiässeid pittáid.

source: Amoc käyttää teksteissään paljon vertauksia eikä tee perinteistä iskulinjaräppiä.
smn: Amoc kiävttá suu teevstâin ennuv viärdádâsâid ijge räähti ärbivuáválâš čurmâmlinjâšrääpi.

source: Teemoihin hän toisinaan löytää inspiraation saamelaisesta mytologiasta.
smn: Sämmilâš mytologia addel sunjin motomin inspiraatio teemaid.

source: Muutoin saamelaisuus näkyy Amocin musiikissa tekijän saamelaisuuden lisäksi tekstien saamenkielisyytenä.
smn: Mudoi sämmilâšvuotâ uáinoo Amoc musiikist tevstâi sämikielâlâšvuottân.

source: Biittien suhteen hänellä on globaali maku, Mikkal ei ole yrittänyt tuoda esimerkiksi soitinmaailman kautta saamelaisuutta biitteihin.
smn: Suu biitij stijlâ lii maailmvijđásâš, Mikkâl ij lah irâttâm pyehtiđ sämmilâšvuođâ toid ovdâmerkkân instrumentmaailm peht.

source: Toisaalta on toissijaista eritellä mikä kappaleissa on saamelaista ja mikä ei.
smn: Nube tááhust ij lah tehálâš sierriistâllâđ, et moh ääših láá sämmiliih já moh iä.

source: Amocin itsensä mielestä saamelaisen musiikin määritteeksi riittää, että tekijä on saamelainen.
smn: Amoc jiejâs mielâst sämmilâš muusik miäruštâllâmin pijsáá to, et muusikrähtee lii sämmilâš.

source: Mikkalin musiikkirintamalle kuuluu tällä hetkellä hyvää.
smn: Mikkâl muusikpeeli ovdán táál pyereest.

source: Amoc on alkanut keikkailla nyt myös bändin kanssa, mikä tuo uuden mielenkiintoisen lisän live-meininkiin.
smn: Amoc lii álgâm lávástâllâđ táál meiddei bändijn, mii puáhtá mielâkiddiivâš lase live-fiäránân.

source: Bändin kanssa Amoc esiintyy muun muassa Riddu Riđđu – alkuperäiskansafestivaaleilla 2015 Pohjois-Norjassa.
smn: Bändijn Amoc lávdástâl el. Riddu Riđđu - algâaalmugfestivaalijn 2015 Tave-Taažâst.

source: Siellä pidetään myös Inger-Mari Aikio-Arianaickin ohjaaman “ Amoc – Vuosmuš ” - dokumenttifilmin ensi-ilta.
smn: Tobbeen tuálloo meiddei Inger-Mari Aikio-Arianaick stivrim ” Amoc ¨– Vuosmuš ” - dokumentfiilmâ vuosâeehid.

source: Lisäksi kesällä 2015 ilmestyy Amocin toinen albumi, joka kulkee työnimellä Faabelit.
smn: Lasseen keessiv 2015 almostuvá Amoc nubbe album, mon pargonommân lii Faabelit.

source: Uudella levyllä on Mikkalin itsensä mukaan ensimmäiseen täyspitkään Amok-kaččâm - levyyn verrattuna mustan huumorin lisäksi enemmän pilkettä.
smn: Uđđâ skiärrust lii Mikkâl mield eenâb čapis huumor já suottâs ko vuosmuš oleskukkosâš Amok-kaččâm - skiärrust.

source: Uusi levv on monimuotoinen ja sieltä löytyy jopa yksi metallibiisi.
smn: Uđđâ skiärru lii maaaŋgâhámásâš já tast lii ohtââ meetaalpittá-uv.

source: Tekstillisesti uusi levy on tarinallinen.
smn: Tevstâlávt uđđâ skiärru lii mainâsteijee.

source: Se sisältää näkemyksiä tulevaisuuteen sekä muutaman henkilökohtaisemman kappaleen.
smn: Tast láá uáinuh puátteevuođâst sehe muáddi persovnlâš pitá.

source: Lyriikoista löytyy metaforia, jotka viittaavat yhteiskunnallisiin ongelmiin globaalilla tasolla.
smn: Lyriikkain láá metaforah ohtsâskodálijn čuolmâin gloobaallâš tääsist.

source: Muuten Amocia ei saarnaaminen kiinnosta eikä hän halua ottaa kantaa politiikkaan.
smn: Mudoi Amoc ij lah kiäsuttum säärnidmist ijge sun haalijd väldiđ uáivil politiikan.

source: - Minulla ei ole taka-ajatuksena vaikuttaa ihmisten ajatuksiin, sanoo Mikkal.
smn: - Must ij lah tyehijuurdân vaiguttiđ ulmui jurduid, iätá Mikkâl.

source: - Päällimmäinen tarkoitus on tehdä viihdetaidetta itselle ja kavereille, ja jos muutkin ihmiset haluavat kuunnella, niin se on vain hyvä asia.
smn: - Tehálumâš ulme lii rähtiđ makkuuttâstaiđuu olssân já skipárijd, já jis eres ulmuuh-uv halideh kuldâliđ, te to lii tuše šiev äšši.

source: Linkkejä:
smn: Liiŋkih:

source: Teksti ja kuvat: Milla Elmiina Pulska
smn: Tekstâ já koveh: Milla Elmiina Pulska
